html/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="https://earthexplorer.usgs.gov/inventory/soap" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <SOAP-ENV:Body>
        <ns1:search>
            <datasetName xsi:type="xsd:string">LANDSAT_8</datasetName>
            <lowerLeft xsi:type="ns1:Service_Class_Coordinate">
                <latitude xsi:type="xsd:double">33.93</latitude>
                <longitude xsi:type="xsd:double">-79.4</longitude>
            </lowerLeft>
            <upperRight xsi:type="ns1:Service_Class_Coordinate">
                <latitude xsi:type="xsd:double">35.27101</latitude>
                <longitude xsi:type="xsd:double">-76.88</longitude>
            </upperRight>
            <startDate xsi:type="xsd:string">2013-08-05T00:00:00Z</startDate>
            <endDate xsi:type="xsd:string">2013-09-05T23:59:59Z</endDate>
            <additionalCriteria xsi:nil="true"/>
            <maxResults xsi:type="xsd:int">2</maxResults>
            <startingNumber xsi:type="xsd:int">1</startingNumber>
            <sortOrder xsi:type="xsd:string">ASC</sortOrder>
            <node xsi:type="xsd:string">EE</node>
            <apiKey xsi:type="xsd:string">a5aa79339e624b4084b0983037a383b7</apiKey>
        </ns1:search>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

